[
  {
    "name": "Proxycurl Sandbox API",
    "stakeholder": "Proxycurl",
    "date": "2024 - 2025",
    "tags": ["flask", "python", "data-pipeline"],
    "image": "proxycurl.png",
    "url": "https://nubela.co/proxycurl/",
    "description": "In this project, I developed sandbox mode for Proxycurl's API endpoints. This API sandbox will be used by users to test things out in sandbox mode so that users don't have to spend credits while testing things. I also build its data pipeline to seamless the integration with the live mode"
  },
  {
    "name": "Sapiengraph Job Monitoring",
    "stakeholder": "Proxycurl",
    "date": "2024 - 2025",
    "tags": ["flask", "python", "websocket"],
    "image": "sapiengraph.png",
    "url": "https://sapiengraph.com/",
    "description": "Sapiengraph is an integrated version of Proxycrul API. In this project, I contributed to the bulk job monitoring feature, contributed to the sync feature for spreadsheet integration into sapiengraph, and contributed to the email finder feature"
  },
  {
    "name": "UniLah Overseas Campus (UOC)",
    "stakeholder": "UniLah",
    "date": "2024",
    "tags": ["react", "nestjs", "postgresql", "payment"],
    "image": "uoc.png",
    "url": "https://uoc.myunilah.com/",
    "description": "A job portal for employer to seek overseas students. In this project, I managed all the frontend and backend. In this app, employer and student can manage their job application. For employer, they also can mass message selected student by outreaching them via email"
  },
  {
    "name": "UniLah Admin",
    "stakeholder": "UniLah",
    "date": "2024",
    "tags": ["react", "nestjs", "postgresql", "message-queue"],
    "image": "admin-unilah.png",
    "url": "https://admin.myunilah.com/",
    "description": "Admin dashboard to manage all the content of UniLah platform. In this project, I managed most of the backend and frontend. I also refactored the UI to the current UI and refactored the dashboard in general to include the UOC as well"
  },
  {
    "name": "UniLah App",
    "stakeholder": "UniLah",
    "date": "2024",
    "tags": ["react-native", "nestjs", "postgresql"],
    "image": "unilah-app.jpg",
    "description": "UniLah App is a mobile app for students to attend university events and redeem some product deals. In this project, I managed some feature of the backend. I also refactored some component of the app"
  }
]